In [3]:
# Task #1:
# Create a 2D numpy array containing random numbers in range 1 to 10 organized in 4 rows and 6 columns.

import numpy as np
arr1 = np.random.randint(low=1,high=10,size=(4,6))
arr1

array([[5, 9, 8, 3, 5, 9],
       [6, 8, 7, 6, 6, 7],
       [4, 3, 9, 8, 5, 5],
       [3, 9, 8, 3, 4, 1]])

In [4]:
# Task #2:
# Find the mean value of the last 2 rows and last 3 columns of the array from Task 1.


arr2 = arr1[-2:,-3:]
arr2mean = arr2.mean()

arr2mean

4.333333333333333

In [5]:
# Task #3:
# Negate elements in the 2nd column of the array from Task 1 
# whose value is between 6-9, in place.

# secondColumn= arr1[:,1]
# indexesToNegate=np.where((secondColumn >6) & (secondColumn<9))
# secondColumn[indexesToNegate] *= -1

arr1[:,1][np.where((arr1[:,1]>6) & (arr1[:,1]<9) )] *= -1

print(arr1)

[[ 5  9  8  3  5  9]
 [ 6 -8  7  6  6  7]
 [ 4  3  9  8  5  5]
 [ 3  9  8  3  4  1]]

In [6]:
# Task #4:
# Consider the following Python dictionary students and Python list student_ids:

# NOTE: “dl” stands for distance learning

students= { 
'name': ["Harry", "Jack", "Charlie", "Thomas", "James", "Olivia", "Emily", "Jessica", "Oscar", "Mary"], 
'grade' : [5,6,9,7,10,8,6,7,9,8], 
'attendance' : [10,45,85,90,np.nan,87,30,np.nan,100,65], 
'dl' : [True,False,False,False,True,True,False,False,False,True]
} 

student_ids = [423,334,546,224,867,989,178,879,113,555]

import pandas as pd

In [7]:
# a) Create a DataFrame df from this dictionary students which has the index student_ids.

df = pd.DataFrame(students, index=student_ids)

df

        name  grade  attendance     dl
423    Harry      5        10.0   True
334     Jack      6        45.0  False
546  Charlie      9        85.0  False
224   Thomas      7        90.0  False
867    James     10         NaN   True
989   Olivia      8        87.0   True
178    Emily      6        30.0  False
879  Jessica      7         NaN  False
113    Oscar      9       100.0  False
555     Mary      8        65.0   True

In [8]:
# b) Display a summary of the basic information about this DataFrame and its data.
dfb = df.describe()
dfb

           grade  attendance
count  10.000000    8.000000
mean    7.500000   64.000000
std     1.581139   32.460966
min     5.000000   10.000000
25%     6.250000   41.250000
50%     7.500000   75.000000
75%     8.750000   87.750000
max    10.000000  100.000000

In [9]:
# c) Return the first 3 rows of the DataFrame df.
dfc = df[:3]
dfc

        name  grade  attendance     dl
423    Harry      5        10.0   True
334     Jack      6        45.0  False
546  Charlie      9        85.0  False

In [10]:
# d) Select just grade and dl columns from df DataFrame.
dfd = df[['grade', 'dl']]
dfd

     grade     dl
423      5   True
334      6  False
546      9  False
224      7  False
867     10   True
989      8   True
178      6  False
879      7  False
113      9  False
555      8   True

In [11]:
# e) Select the data in rows [5,7,9] and columns [grade, attendance].
# dfe = df[['grade','attendance']]

dfe = df[5:10:2]

print(df)

print(' ')

print(dfe)

        name  grade  attendance     dl
423    Harry      5        10.0   True
334     Jack      6        45.0  False
546  Charlie      9        85.0  False
224   Thomas      7        90.0  False
867    James     10         NaN   True
989   Olivia      8        87.0   True
178    Emily      6        30.0  False
879  Jessica      7         NaN  False
113    Oscar      9       100.0  False
555     Mary      8        65.0   True

        name  grade  attendance     dl
989   Olivia      8        87.0   True
879  Jessica      7         NaN  False
555     Mary      8        65.0   True

In [12]:
# f) Select rows where attendance is greater than 70.

dff = df[df['attendance']>70]
dff

        name  grade  attendance     dl
546  Charlie      9        85.0  False
224   Thomas      7        90.0  False
989   Olivia      8        87.0   True
113    Oscar      9       100.0  False

In [13]:
# g) Select the rows where the attendance is missing, i.e. is NaN.

dfg = df[df['attendance'].isnull()]
dfg

        name  grade  attendance     dl
867    James     10         NaN   True
879  Jessica      7         NaN  False

In [14]:
# j) Select distance learning students where the grade is greater than 7.

dfj = df[(df['dl']==True) & (df['grade']>7)]
dfj

       name  grade  attendance    dl
867   James     10         NaN  True
989  Olivia      8        87.0  True
555    Mary      8        65.0  True

In [15]:
# k) Find the mean grade and attendance of all students.

dfk_mean_grade = df['grade'].mean()
print(dfk_mean_grade)

print('\n ... \n')

dfk_attendance = df['attendance']
print(dfk_attendance)

7.5

 ...

423     10.0
334     45.0
546     85.0
224     90.0
867      NaN
989     87.0
178     30.0
879      NaN
113    100.0
555     65.0
Name: attendance, dtype: float64

In [24]:
# l) Find student with greatest grade and student with lowest attendance

student_with_greatest_grade = df[df['grade'] == df['grade'].max()]
print(student_with_greatest_grade)

student_with_lowest_attendance = df[df['attendance'] == df['attendance'].min()]
print(student_with_lowest_attendance)

      name  grade  attendance    dl
867  James     10         NaN  True
      name  grade  attendance    dl
423  Harry      5        10.0  True

In [35]:
# Task #5:
# Using the random_text.txt file (available on LMS), write a program in Python for the following tasks:
# Extract all phone numbers from the random text and add them to the list phoneNumbers.
# Extract all emails with the “.com” extension and add them to the list emails. (ex. …@hotmail.com should be accepted, but …@ibu.edu.ba should be rejected)


randomText = open("random_text.txt", "r", encoding="utf8")
randomTextArray = randomText.readlines()
print(lines)

# yourResult = [line.split('') for line in randomText.readlines()]

# print(yourResult)

dotComEmails = []

['(381) 3222985\n', 'uncled@mac.com\n', 'retina_logo.svg\n', 'mar_adine@outlook.com\n', '0049 515 6828458\n', '+381 2056848\n', 'Nature2345.jpg\n', 'paley@yahoo.ca\n', 'drolsky@sbcglobal.net\n', '<h2>Subtitle</h2>\n', 'kmiller@yahoo.ca\n', 'scottlee@com.cast.net\n', '<a href=“javascript::”>Click Me</a>\n', 'homework.pdf\n', 'kohlis@optonline.net\n', '(387) 547-2359\n', 'guialbu@live.com\n', '00387 901-813\n', 'animals.png\n', '+385 260-7825\n', 'sjmu.ir@opton-line.net\n', 'kramu_lous78@yahoo.com\n', '00387 547-2469\n', 'netsfr@yahoo.ca\n', '+387 232693\n', 'Logo.png\n', 'carroll@hotmail.com\n', '<div class=“col-md-12”>Title</div>\n', 'loading.gif\n', '<p>Some nice paragraph</p>\n', 'debest@outlook.com\n', '<div>Test</div>\n', '<a href=“mailto:test_mail@gmail.com”>Contact Me!!</a>\u2028']